// จงเขียนโปรแกรมแปลข้อความภาษาอังกฤษให้เป็น Morse Code (Level 5)
#include <stdio.h>

int main()
{
    char morsecode[][5] = {".-",    // a
                           "-...",  // b
                           "-.-.",  // c
                           "-..",   // d
                           ".",     // e
                           "..-.",  // f
                           "--.",   // g
                           "....",  // h
                           "..",    // i
                           ".---",  // j
                           "-.-",   // k
                           ".-..",  // l
                           "--",    // m
                           "-.",    // n
                           "---",   // o
                           ".--.",  // p
                           "--.-",  // q
                           ".-.",   // r
                           "...",   // s
                           "-",     // t
                           "..-",   // u
                           "...-",  // v
                           ".--",   // w
                           "-..-",  // x
                           "-.--",  // y
                           "--..",  // z
                           ".----", // 1
                           "..---", // 2
                           "...--", // 3
                           "....-", // 4
                           ".....", // 5
                           "-....", // 6
                           "--...", // 7
                           "---..", // 8
                           "----.", // 9
                           "-----", // 0
                           "/"};    // spacebar
    char ch;
    while ((ch = getchar()) != '\n')
    {
        if (ch == '0')
        {
            printf("%s ", morsecode[35]);
        }
        else if (ch >= '1' && ch <= '9')
        {
            printf("%s ", morsecode[ch - '0' + 25]);
        }
        else if (ch == ' ')
        {
            printf("%s ", morsecode[36]);
        }
        else
        {
            printf("%s ", morsecode[ch - 'a']);
        }
    }
    return 0;
}